<!DOCTYPE html>
<html lang="es">
    <head>
        <meta charset="utf-8"/>
        <title>FreeBrowser</title>
        <link href="styles.css" rel="stylesheet"/>
    </head>
    <body>
        <p>
            <h1>Bienveindo a FreeBrowser!</h1>
            FreeBrowser le permite navegar la web mediante correo
            electr&oacute;nico, similar en principio al navegador
            <a href="http://tek.sourceforge.net">TEK</a>, pero mucho
            m&aacute;s simple (solamente cliente) y puede ser configurado
            para usar de forma f&aacute;cil cualquier servicio similar a
            webpage-grabber o web2mail.
            <br/>
            Este programa fue hecho para personas con acceso limitado o
            nulo a Internet que tienen acceso a una cuenta de correo
            electr&oacute;nico, tambi&eacute;n puede ser &uacute;til
            para aquellos que por su lugar de procedencia son bloqueados
            por algunos sitios (ejemplo: algunas p&aacute;ginas de Google
            muestan un robot roto a personas en Cuba en lugar de su
            contenido) y para aquellos que no pueden darse el lujo de
            pagar por acceso a Internet.
            <br/>
            <b>Nota:</b> Por lo general el proveedor de los servicios que
            que necesita este programa para funcionar se encuentra en
            otro pa&iacute;s diferente al de los usuarios por lo que su
            cuenta de correo debe ser capaz de enviar correos a esos
            pa&iacute;ses.
        </p>
        <p>
            <h1>C&oacute;mo usarlo?</h1>
            Este programa requiere java 1.5 o mayor para funcionar y
            depende de un navegador para mostrar p&aacute;ginas web.
            Antes de empezar a navegar debe ir al men&uacute;
            Editar/Preferencias y configurar los datos de su correo
            electr&oacute;nico, poner la ruta donde se encuentra el
            navegador con el que este programa le mostrar&aacute; las
            p&aacute;ginas web, y configurar el servicio de envio de
            p&aacute;ginas web a su correo.
            <br/>
            Luego para visitar un sitio: "http://ejemplo.com" debe pegar
            esa direcci&oacute;n en el campo de texto de la izquierda (el
            m&aacute;s largo) y presionar la tecla "Enter".
            <br/>
            Para buscar alguna informaci&oacute;n en un motor de
            b&uacute;squeda escriba la frase en el campo de texto de la
            derecha (el m&aacute;s peque&ntilde;o) y presione la tecla
            "Enter".
            <br/>
            Para mover la ventana del programa presione en cualquier
            regi&oacute;n vac&iacute;a y arraste la ventana hasta la
            posici&oacute;n deseada.
            <br/>
            Este programa puede guardar todos los mensajes informativos
            o de errores en un fichero para su posterior an&aacute;lisis
            en la carpeta "assets" con la extensi&oacute;n ".log".
            <br/>
            Si su servidor de correos o el proveedor del servicio con el
            que configur&oacute; este programa son lentos, puede ir al
            men&uacute; Herramientas/Juegos y jugar alg&uacute;n juego
            HTML5 en su navegador (si este lo soporta) mientras espera
            a que su p&aacute;gina web sea recuperada, el tiempo
            pasar&aacute; m&aacute;s r&aacute;pido :-)
        </p>
        <p>
            <h1>C&oacute;mo puedo ayudar?</h1>
            Si usted tiene acceso a Internet puede ayudar a otras
            personas montando un servicio como:
            <ul>
                <li>
                    <a href="https://github.com/fidian/webpage">
                        Webpage Grabber
                    </a>
                </li>
            </ul>
            Si no tiene acceso a Internet puede ayudar a otras personas
            como usted compartiendo este programa con ellas.
            <br/>
            Tambi&eacute;n todos pueden ayudar escribiendo un correo a
            <a href="mailto:asieldbenitez@gmail.com">asieldbenitez@gmail.com</a> con
            direcciones de correo de servicios que puedan ser usados por 
            este programa o que este pudiera ser adaptado para soportar,
            as&iacute; una lista de estos servicios puede ser
            distribuida junto con este programa.
            <br/>
            Si eres un programador o un traductor y quieres colaborar en
            el desarrollo de este programa, eres bienvenido!
        </p>
    </body>
</html>
